load-tests/load-test.yaml
config:
  target: "https://api.appdost.com"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Phase 1: Warm up (150 HTTP users)"
    - duration: 60
      arrivalRate: 30
      rampTo: 60
      name: "Phase 2: Ramp up to 2700 HTTP connections"
    - duration: 30
      arrivalRate: 60
      name: "Phase 3: Hold at peak load"

scenarios:
  - name: "API Endpoint Flood Test"
    flow:
      # Hit the main health/API endpoint simultaneously
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer test_load_token"
      - think: 1
      - get:
          url: "/api/listeners/online"
      - think: 1
      - post:
          url: "/api/auth/refresh"
          json:
            token: "load_test_token_{{ $randomString() }}"